'use stict';

/**
Вывести в консоль значения выражений и объяснить почему получились такие значения
используя комментарии к каждому выражению:
```
10 + 10 + "10"
10 + "10" + 10
10 + 10 + +"10"
10 / -""
10 / +"2,5"
```
 */

console.log(`10 + 10 + "10" = ${10 + 10 + "10"}. т.к. число + число + строка = 2010.`, 10 + 10 + "10" === '2010');
console.log(`10 + "10" + 10 = ${10 + "10" + 10}. т.к. число + строка + число = 101010.`, 10 + "10" + 10 === '101010');
console.log(`10 + 10 + +"10" = ${10 + 10 + +"10"}. т.к. число + число + строка, преобразованная\ в число = 30.`, 10 + 10 + +"10" === 30);
console.log(`10 / -"" = ${10 / -""}. т.к. 10/-0 = -infinity.`, 10 / -"" === -Infinity);
console.log(`10 / +"2,5" = ${10 / +"2,5"}. т.к. 10/NaN = NaN.`, isNaN(10 / +"2,5"));