// 4*. С помощью цикла while вывести все простые числа в промежутке от 0 до 100
// (можно без оптимизаций).
let i = 2;

// console.log(` Простое 2 \n`);
// console.log(` Простое 3 \n`);
// console.log(` Простое 5 \n`);
// console.log(` Простое 7 \n`);


while (i < 100) {
    if (i === 2 || i === 3 || i === 5 || i === 7|| i === 11|| i === 13) {
        console.log(` Простое ${i} \n`);
    }

    for (let j = 2, counter = 0; j < i; j++) {        
        if (i % j === 0 || i % 3 === 0 || i % 4 === 0 || i % 5 === 0 || i % 7 === 0|| i % 11 === 0|| i % 13 === 0) {
            counter++;
        }
        if (counter < 1) {
            console.log(` Простое ${i} \n`);
        }
    }

    i++;
}