'use stict';

/**
Вывести в консоль значения выражений и объяснить почему получились такие значения
используя комментарии к каждому выражению:
```
10 + 10 + "10"
10 + "10" + 10
10 + 10 + +"10"
10 / -""
10 / +"2,5"
```
 */

console.log(`${10 + 10 + "10"}. 2010 (10+10=20 20+'10'=2010)`);
console.log(`${10 + "10" + 10}. 101010 (10+'10'=1010 '1010'+10=101010)`);
console.log(`${10 + 10 + +"10"}. 30 (10+10+10=30)`);
console.log(`${10 / -""}. -Infinity`);
console.log(`${10 / +"2,5"}. NaN (10 / на строку = NaN)`);