/*3. * Сеть фастфудов предлагает несколько видов гамбургеров:
** - маленький(50 рублей, 20 калорий);**
    - большой(100 рублей, 40 калорий).
Гамбургер может быть с одним из нескольких видов начинок(обязательно):
** - сыром(+ 10 рублей, + 20 калорий);**
** - салатом(+ 20 рублей, + 5 калорий);**
    - картофелем(+ 15 рублей, + 10 калорий).

* Дополнительно гамбургер можно посыпать приправой(+ 15 рублей, 0 калорий) и полить майонезом(+ 20 рублей, + 5 калорий). *
*/

function Hamburger(size, stuffing){

}